#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: bffea20bc9853675d8488dfbd06ac372.pdb
; shader hash: bffea20bc9853675d8488dfbd06ac372
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_BRDFMap                             UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%dx.types.Handle = type { i8* }
%dx.types.Dimensions = type { i32, i32, i32, i32 }
%"class.RWTexture2D<vector<float, 4> >" = type { <4 x float> }

@dx.nothing.a = internal constant [1 x i32] zeroinitializer

define void @CSMain() {
  %g_BRDFMap_UAV_2d = call %dx.types.Handle @dx.op.createHandle(i32 57, i8 1, i32 0, i32 0, i1 false), !dbg !86 ; line:87 col:5  ; CreateHandle(resourceClass,rangeId,index,nonUniformIndex)
  %1 = call i32 @dx.op.threadId.i32(i32 93, i32 0)  ; ThreadId(component)

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !61)
!1 = !DIFile(filename: "shaders\5CcreateBRDFMap.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !24, !8}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 87, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 87, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 87, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 87, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 87, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 87, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 16, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 16, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 16, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 85, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 85, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 85, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 85, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !{!32, !44, !47, !52, !55, !58}
!32 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 77, type: !33, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !37, templateParams: !42)
!37 = !{!38, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!43, !23}
!43 = !DITemplateTypeParameter(name: "element", type: !39)
!44 = !DISubprogram(name: "IntegrateBRDF", linkageName: "\01?IntegrateBRDF@@YA?AV?$vector@M$01@@MM@Z", scope: !1, file: !1, line: 14, type: !45, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!24, !8, !8}
!47 = !DISubprogram(name: "Hammersley", linkageName: "\01?Hammersley@@YA?AV?$vector@M$01@@II@Z", scope: !48, file: !48, line: 66, type: !49, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DIFile(filename: "shaders/helperFunctions.hlsli", directory: "")
!49 = !DISubroutineType(types: !50)
!50 = !{!24, !51, !51}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !39)
!52 = !DISubprogram(name: "RadicalInverse_VdC", linkageName: "\01?RadicalInverse_VdC@@YAMI@Z", scope: !48, file: !48, line: 56, type: !53, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!8, !51}
!55 = !DISubprogram(name: "ImportanceSampleGGX", linkageName: "\01?ImportanceSampleGGX@@YA?AV?$vector@M$02@@V?$vector@M$01@@MV1@@Z", scope: !48, file: !48, line: 76, type: !56, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!16, !24, !8, !16}
!58 = !DISubprogram(name: "V_SmithGGXCorrelated", linkageName: "\01?V_SmithGGXCorrelated@@YAMMMM@Z", scope: !48, file: !48, line: 135, type: !59, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{!8, !8, !8, !8}
!61 = !{!62}
!62 = !DIGlobalVariable(name: "g_BRDFMap", linkageName: "\01?g_BRDFMap@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 12, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 12, size: 128, align: 32, elements: !2, templateParams: !64)
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "element", type: !5)
!66 = !{i32 2, !"Dwarf Version", i32 4}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
