#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; TEXCOORD                 0   xy          1     NONE   float       
; NORMAL                   0   xyz         2     NONE   float       
; TANGENT                  0   xyz         3     NONE   float       
; BITANGENT                0   xyz         4     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; OBJECT_POSITION          0   xyz         1     NONE   float   xyz 
;
; shader debug name: b4160121de597ca7fbb7cab9057affb7.pdb
; shader hash: b4160121de597ca7fbb7cab9057affb7
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              
; NORMAL                   0                              
; TANGENT                  0                              
; BITANGENT                0                              
;
; Output signature:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !61)
!1 = !DIFile(filename: "shaders\5CcreateIrradianceMap.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 38, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 38, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!18, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!31 = !{!32}
!32 = !DISubprogram(name: "VSMain", scope: !1, file: !1, line: 35, type: !33, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @VSMain)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !47}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 28, size: 224, align: 32, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "clip_position", scope: !35, file: !1, line: 30, baseType: !22, size: 128, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "obj_position", scope: !35, file: !1, line: 31, baseType: !39, size: 96, align: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !41, templateParams: !45)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !40, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !{!18, !46}
!46 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 19, size: 448, align: 32, elements: !48)
!48 = !{!49, !50, !58, !59, !60}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "obj_position", scope: !47, file: !1, line: 21, baseType: !39, size: 96, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !47, file: !1, line: 22, baseType: !51, size: 64, align: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !53, templateParams: !56)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !52, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !52, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !{!18, !57}
!57 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "obj_normal", scope: !47, file: !1, line: 23, baseType: !39, size: 96, align: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "obj_tangent", scope: !47, file: !1, line: 24, baseType: !39, size: 96, align: 32, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "obj_bitangent", scope: !47, file: !1, line: 25, baseType: !39, size: 96, align: 32, offset: 352)
!61 = !{!62, !93, !97}
!62 = !DIGlobalVariable(name: "g_camera", linkageName: "\01?g_camera@@3U?$ConstantBuffer@UCameraConstants@@@@A", scope: !0, file: !1, line: 15, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraConstants>", file: !1, line: 15, size: 32, align: 32, elements: !2, templateParams: !64)
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "T", type: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraConstants", file: !67, line: 24, size: 1024, align: 32, elements: !68)
!67 = !DIFile(filename: "shaders/../ShaderSharedStructs.h", directory: "")
!68 = !{!69, !92}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !66, file: !67, line: 26, baseType: !70, size: 512, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 15, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 15, size: 512, align: 32, elements: !72, templateParams: !89)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !71, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!89 = !{!18, !90, !91}
!90 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!91 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !66, file: !67, line: 27, baseType: !70, size: 512, align: 32, offset: 512)
!93 = !DIGlobalVariable(name: "g_cubemap", linkageName: "\01?g_cubemap@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 16, type: !94, isLocal: false, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 16, size: 128, align: 32, elements: !2, templateParams: !95)
!95 = !{!96}
!96 = !DITemplateTypeParameter(name: "element", type: !23)
!97 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 17, type: !98, isLocal: false, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 17, size: 32, align: 32, elements: !2)
!99 = !{i32 2, !"Dwarf Version", i32 4}
!100 = !{i32 2, !"Debug Info Version", i32 3}
!101 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
