#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 505bc06d928f934093bbab82dcc63b0f.pdb
; shader hash: 505bc06d928f934093bbab82dcc63b0f
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer g_cb
; {
;
;   struct g_cb
;   {
;
;       struct struct.BlurConstants
;       {
;
;           int blurRadius;                           ; Offset:    0
;           uint srcWidth;                            ; Offset:    4
;           uint srcHeight;                           ; Offset:    8
;           uint srcMipLevel;                         ; Offset:   12
;       
;       } g_cb;                                       ; Offset:    0
;
;   
;   } g_cb;                                           ; Offset:    0 Size:    16
;
; }
;
; cbuffer g_kernel
; {
;
;   struct g_kernel
;   {
;
;       struct struct.BlurKernel
;       {
;
;           float w[68];                              ; Offset:    0
;       
;       } g_kernel;                                   ; Offset:    0
;
;   
;   } g_kernel;                                       ; Offset:    0 Size:  1076
;
; }
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !25, globals: !48)
!1 = !DIFile(filename: "shaders\5Cfilter2DSeparable.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 31, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 31, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 30, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 30, size: 128, align: 32, elements: !16, templateParams: !22)
!16 = !{!17, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 30, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !18)
!24 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!25 = !{!26, !29, !32, !42, !45}
!26 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 149, type: !27, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !4, !4}
!29 = !DISubprogram(name: "LoadPixel", linkageName: "\01?LoadPixel@@YA?AV?$vector@M$03@@HH@Z", scope: !1, file: !1, line: 34, type: !30, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!30 = !DISubroutineType(types: !31)
!31 = !{!14, !8, !8}
!32 = !DISubprogram(name: "LoadDataToSharedMemory", linkageName: "\01?LoadDataToSharedMemory@@YAXV?$vector@H$01@@0@Z", scope: !1, file: !1, line: 41, type: !33, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35, !35}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 39, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 39, size: 64, align: 32, elements: !37, templateParams: !40)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 39, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !{!12, !41}
!41 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!42 = !DISubprogram(name: "FilterHorizontal", linkageName: "\01?FilterHorizontal@@YAXV?$vector@H$01@@@Z", scope: !1, file: !1, line: 90, type: !43, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !35}
!45 = !DISubprogram(name: "FilterVertical", linkageName: "\01?FilterVertical@@YA?AV?$vector@M$03@@V?$vector@H$01@@@Z", scope: !1, file: !1, line: 134, type: !46, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!14, !35}
!48 = !{!49, !62, !72, !76, !78, !82}
!49 = !DIGlobalVariable(name: "g_cb", linkageName: "\01?g_cb@@3U?$ConstantBuffer@UBlurConstants@@@@A", scope: !0, file: !1, line: 20, type: !50, isLocal: false, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<BlurConstants>", file: !1, line: 20, size: 32, align: 32, elements: !2, templateParams: !51)
!51 = !{!52}
!52 = !DITemplateTypeParameter(name: "T", type: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "BlurConstants", file: !54, line: 74, size: 128, align: 32, elements: !55)
!54 = !DIFile(filename: "shaders/../ShaderSharedStructs.h", directory: "")
!55 = !{!56, !57, !60, !61}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "blurRadius", scope: !53, file: !54, line: 76, baseType: !8, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "srcWidth", scope: !53, file: !54, line: 77, baseType: !58, size: 32, align: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 20, baseType: !59)
!59 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "srcHeight", scope: !53, file: !54, line: 78, baseType: !58, size: 32, align: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "srcMipLevel", scope: !53, file: !54, line: 79, baseType: !58, size: 32, align: 32, offset: 96)
!62 = !DIGlobalVariable(name: "g_kernel", linkageName: "\01?g_kernel@@3U?$ConstantBuffer@UBlurKernel@@@@A", scope: !0, file: !1, line: 21, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<BlurKernel>", file: !1, line: 21, size: 32, align: 32, elements: !2, templateParams: !64)
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "T", type: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "BlurKernel", file: !54, line: 82, size: 2176, align: 32, elements: !67)
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !66, file: !54, line: 86, baseType: !69, size: 2176, align: 32)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 2176, align: 32, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 68)
!72 = !DIGlobalVariable(name: "g_input", linkageName: "\01?g_input@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 22, type: !73, isLocal: false, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 22, size: 160, align: 32, elements: !2, templateParams: !74)
!74 = !{!75}
!75 = !DITemplateTypeParameter(name: "element", type: !15)
!76 = !DIGlobalVariable(name: "g_output", linkageName: "\01?g_output@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 23, type: !77, isLocal: false, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 23, size: 128, align: 32, elements: !2, templateParams: !74)
!78 = !DIGlobalVariable(name: "g_cache_load", linkageName: "\01?g_cache_load@@3PAY0CA@$$CAV?$vector@M$03@@A.v.1dim", scope: !0, file: !1, line: 30, type: !79, isLocal: false, isDefinition: true, variable: [4096 x float] addrspace(3)* @"\01?g_cache_load@@3PAY0CA@$$CAV?$vector@M$03@@A.v.1dim")
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 131072, align: 32, elements: !80)
!80 = !{!81, !81}
!81 = !DISubrange(count: 32)
!82 = !DIGlobalVariable(name: "g_cache_filter", linkageName: "\01?g_cache_filter@@3PAY0CA@$$CAV?$vector@M$03@@A.v.1dim", scope: !0, file: !1, line: 31, type: !83, isLocal: false, isDefinition: true, variable: [2048 x float] addrspace(3)* @"\01?g_cache_filter@@3PAY0CA@$$CAV?$vector@M$03@@A.v.1dim")
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 65536, align: 32, elements: !84)
!84 = !{!85, !81}
!85 = !DISubrange(count: 16)
!86 = !{i32 2, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
