#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: e5d7e3b754437040d6a11827569dc7bd.pdb
; shader hash: e5d7e3b754437040d6a11827569dc7bd
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer g_cb
; {
;
;   struct g_cb
;   {
;
;       struct struct.GenerateMipsConstants
;       {
;
;           uint SrcMipLevel;                         ; Offset:    0
;           uint NumMipLevels;                        ; Offset:    4
;           uint SrcDimension;                        ; Offset:    8
;           int IsSRGB;                               ; Offset:   12
;           float2 TexelSize;                         ; Offset:   16
;           uint ArraySlice;                          ; Offset:   24
;       
;       } g_cb;                                       ; Offset:    0
;
;   
;   } g_cb;                                           ; Offset:    0 Size:    28
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !58)
!1 = !DIFile(filename: "shaders\5CgenerateMipmaps.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 93, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 93, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 93, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 87, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 87, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 87, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 87, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 86, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 86, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 86, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!12, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!31 = !{!32, !45, !48, !52, !55}
!32 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 78, type: !33, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35, !44}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 47, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 47, size: 96, align: 32, elements: !37, templateParams: !42)
!37 = !{!38, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 47, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 47, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 47, baseType: !39, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!43, !13}
!43 = !DITemplateTypeParameter(name: "element", type: !39)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 47, baseType: !39)
!45 = !DISubprogram(name: "PackColor", linkageName: "\01?PackColor@@YA?AV?$vector@M$03@@V1@@Z", scope: !1, file: !1, line: 64, type: !46, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!22, !22}
!48 = !DISubprogram(name: "LinearToSRGB", linkageName: "\01?LinearToSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !49, file: !49, line: 17, type: !50, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DIFile(filename: "shaders/helperFunctions.hlsli", directory: "")
!50 = !DISubroutineType(types: !51)
!51 = !{!4, !4}
!52 = !DISubprogram(name: "StoreColor", linkageName: "\01?StoreColor@@YAXIV?$vector@M$03@@@Z", scope: !1, file: !1, line: 49, type: !53, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !44, !22}
!55 = !DISubprogram(name: "LoadColor", linkageName: "\01?LoadColor@@YA?AV?$vector@M$03@@I@Z", scope: !1, file: !1, line: 57, type: !56, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!22, !44}
!58 = !{!59, !63, !64, !65, !66, !79, !83, !85, !86, !87, !88}
!59 = !DIGlobalVariable(name: "gs_R", linkageName: "\01?gs_R@@3PAMA", scope: !0, file: !1, line: 44, type: !60, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_R@@3PAMA")
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, align: 32, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 64)
!63 = !DIGlobalVariable(name: "gs_G", linkageName: "\01?gs_G@@3PAMA", scope: !0, file: !1, line: 45, type: !60, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_G@@3PAMA")
!64 = !DIGlobalVariable(name: "gs_B", linkageName: "\01?gs_B@@3PAMA", scope: !0, file: !1, line: 46, type: !60, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_B@@3PAMA")
!65 = !DIGlobalVariable(name: "gs_A", linkageName: "\01?gs_A@@3PAMA", scope: !0, file: !1, line: 47, type: !60, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_A@@3PAMA")
!66 = !DIGlobalVariable(name: "g_cb", linkageName: "\01?g_cb@@3U?$ConstantBuffer@UGenerateMipsConstants@@@@A", scope: !0, file: !1, line: 27, type: !67, isLocal: false, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<GenerateMipsConstants>", file: !1, line: 27, size: 32, align: 32, elements: !2, templateParams: !68)
!68 = !{!69}
!69 = !DITemplateTypeParameter(name: "T", type: !70)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenerateMipsConstants", file: !71, line: 56, size: 224, align: 32, elements: !72)
!71 = !DIFile(filename: "shaders/../ShaderSharedStructs.h", directory: "")
!72 = !{!73, !74, !75, !76, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "SrcMipLevel", scope: !70, file: !71, line: 58, baseType: !44, size: 32, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "NumMipLevels", scope: !70, file: !71, line: 59, baseType: !44, size: 32, align: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "SrcDimension", scope: !70, file: !71, line: 60, baseType: !44, size: 32, align: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "IsSRGB", scope: !70, file: !71, line: 61, baseType: !14, size: 32, align: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "TexelSize", scope: !70, file: !71, line: 62, baseType: !15, size: 64, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ArraySlice", scope: !70, file: !71, line: 63, baseType: !44, size: 32, align: 32, offset: 192)
!79 = !DIGlobalVariable(name: "SrcMip", linkageName: "\01?SrcMip@@3V?$Texture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 30, type: !80, isLocal: false, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2DArray<vector<float, 4> >", file: !1, line: 30, size: 160, align: 32, elements: !2, templateParams: !81)
!81 = !{!82}
!82 = !DITemplateTypeParameter(name: "element", type: !23)
!83 = !DIGlobalVariable(name: "OutMip1", linkageName: "\01?OutMip1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 33, type: !84, isLocal: false, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 33, size: 128, align: 32, elements: !2, templateParams: !81)
!85 = !DIGlobalVariable(name: "OutMip2", linkageName: "\01?OutMip2@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 34, type: !84, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariable(name: "OutMip3", linkageName: "\01?OutMip3@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 35, type: !84, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariable(name: "OutMip4", linkageName: "\01?OutMip4@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 36, type: !84, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariable(name: "LinearClampSampler", linkageName: "\01?LinearClampSampler@@3USamplerState@@A", scope: !0, file: !1, line: 39, type: !89, isLocal: false, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 39, size: 32, align: 32, elements: !2)
!90 = !{i32 2, !"Dwarf Version", i32 4}
!91 = !{i32 2, !"Debug Info Version", i32 3}
!92 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
