#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; OBJECT_POSITION          0   xyz         1     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 745d9c92a2555d0f7c18a00acac473c6.pdb
; shader hash: 745d9c92a2555d0f7c18a00acac473c6
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; OBJECT_POSITION          0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer g_prefilter
; {
;
;   struct g_prefilter
;   {
;
;       struct struct.PrefilterConstants
;       {
;
;           float roughness;                          ; Offset:    0
;       
;       } g_prefilter;                                ; Offset:    0
;
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !51)
!1 = !DIFile(filename: "shaders\5CprefilterEnvMap.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !15, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 69, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 69, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 69, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 69, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!12, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!31 = !{!32, !39, !45, !48}
!32 = !DISubprogram(name: "PSMain", scope: !1, file: !1, line: 47, type: !33, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @PSMain)
!33 = !DISubroutineType(types: !34)
!34 = !{!15, !35}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 30, size: 224, align: 32, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "clip_position", scope: !35, file: !1, line: 32, baseType: !15, size: 128, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "obj_position", scope: !35, file: !1, line: 33, baseType: !4, size: 96, align: 32, offset: 128)
!39 = !DISubprogram(name: "Hammersley", linkageName: "\01?Hammersley@@YA?AV?$vector@M$01@@II@Z", scope: !40, file: !40, line: 56, type: !41, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false)
!40 = !DIFile(filename: "shaders/helperFunctions.hlsli", directory: "")
!41 = !DISubroutineType(types: !42)
!42 = !{!24, !43, !43}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 49, baseType: !44)
!44 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!45 = !DISubprogram(name: "RadicalInverse_VdC", linkageName: "\01?RadicalInverse_VdC@@YAMI@Z", scope: !40, file: !40, line: 46, type: !46, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!8, !43}
!48 = !DISubprogram(name: "ImportanceSampleGGX", linkageName: "\01?ImportanceSampleGGX@@YA?AV?$vector@M$02@@V?$vector@M$01@@MV1@@Z", scope: !40, file: !40, line: 66, type: !49, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!4, !24, !8, !4}
!51 = !{!52, !83, !90, !94}
!52 = !DIGlobalVariable(name: "g_camera", linkageName: "\01?g_camera@@3U?$ConstantBuffer@UCameraConstants@@@@A", scope: !0, file: !1, line: 16, type: !53, isLocal: false, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraConstants>", file: !1, line: 16, size: 32, align: 32, elements: !2, templateParams: !54)
!54 = !{!55}
!55 = !DITemplateTypeParameter(name: "T", type: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraConstants", file: !57, line: 24, size: 1024, align: 32, elements: !58)
!57 = !DIFile(filename: "shaders/../ShaderSharedStructs.h", directory: "")
!58 = !{!59, !82}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !56, file: !57, line: 26, baseType: !60, size: 512, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 16, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 16, size: 512, align: 32, elements: !62, templateParams: !79)
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !61, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!79 = !{!12, !80, !81}
!80 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!81 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !56, file: !57, line: 27, baseType: !60, size: 512, align: 32, offset: 512)
!83 = !DIGlobalVariable(name: "g_prefilter", linkageName: "\01?g_prefilter@@3U?$ConstantBuffer@UPrefilterConstants@@@@A", scope: !0, file: !1, line: 17, type: !84, isLocal: false, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<PrefilterConstants>", file: !1, line: 17, size: 32, align: 32, elements: !2, templateParams: !85)
!85 = !{!86}
!86 = !DITemplateTypeParameter(name: "T", type: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrefilterConstants", file: !57, line: 46, size: 32, align: 32, elements: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !87, file: !57, line: 48, baseType: !8, size: 32, align: 32)
!90 = !DIGlobalVariable(name: "g_cubemap", linkageName: "\01?g_cubemap@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 18, type: !91, isLocal: false, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 18, size: 128, align: 32, elements: !2, templateParams: !92)
!92 = !{!93}
!93 = !DITemplateTypeParameter(name: "element", type: !16)
!94 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 19, type: !95, isLocal: false, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 19, size: 32, align: 32, elements: !2)
!96 = !{i32 2, !"Dwarf Version", i32 4}
!97 = !{i32 2, !"Debug Info Version", i32 3}
!98 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
