#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 7566b1757514afce801f0374b7232eb1.pdb
; shader hash: 7566b1757514afce801f0374b7232eb1
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer g_tmp
; {
;
;   struct g_tmp
;   {
;
;       struct struct.ToneMapperParams
;       {
;
;           uint toneMappingMode;                     ; Offset:    0
;           float bloomIntensity;                     ; Offset:    4
;       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !44)
!1 = !DIFile(filename: "shaders\5Cpresent.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !31, !43}
!17 = !DISubprogram(name: "PSMain", scope: !1, file: !1, line: 56, type: !18, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @PSMain)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 40, size: 192, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 42, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !1, line: 43, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DISubprogram(name: "LinearToSRGB", linkageName: "\01?LinearToSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !32, file: !32, line: 17, type: !33, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false)
!32 = !DIFile(filename: "shaders/helperFunctions.hlsli", directory: "")
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !35}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 58, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 58, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 58, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 58, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!13, !42}
!42 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!43 = !DISubprogram(name: "ACESFilm", linkageName: "\01?ACESFilm@@YA?AV?$vector@M$02@@V1@@Z", scope: !32, file: !32, line: 28, type: !33, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false)
!44 = !{!45, !56, !60, !61}
!45 = !DIGlobalVariable(name: "g_tmp", linkageName: "\01?g_tmp@@3U?$ConstantBuffer@UToneMapperParams@@@@A", scope: !0, file: !1, line: 26, type: !46, isLocal: false, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ToneMapperParams>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !47)
!47 = !{!48}
!48 = !DITemplateTypeParameter(name: "T", type: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "ToneMapperParams", file: !50, line: 40, size: 64, align: 32, elements: !51)
!50 = !DIFile(filename: "shaders/../ShaderSharedStructs.h", directory: "")
!51 = !{!52, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "toneMappingMode", scope: !49, file: !50, line: 42, baseType: !53, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !54)
!54 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "bloomIntensity", scope: !49, file: !50, line: 43, baseType: !8, size: 32, align: 32, offset: 32)
!56 = !DIGlobalVariable(name: "g_hdrscene", linkageName: "\01?g_hdrscene@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 27, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 27, size: 160, align: 32, elements: !2, templateParams: !58)
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "element", type: !5)
!60 = !DIGlobalVariable(name: "g_hdrbloom", linkageName: "\01?g_hdrbloom@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 28, type: !57, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 29, type: !62, isLocal: false, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 29, size: 32, align: 32, elements: !2)
!63 = !{i32 2, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!66 = !{!"shaders\5Cpresent.hlsl", !"// present.hlsl\0D\0A// Handles the final tone mapping and display of the scene.\0D\0A// Bloom effect is also blended in here.\0D\0A\0D\0A#include \22../ShaderSharedStructs.h\22\0D\0A#include \22helperFunctions.hlsli\22\0D\0A\0D\0A#define g_RootSignature \5C\0D\0A    \22RootFlags(ALLOW_INPUT_ASSEMBLER_INPUT_LAYOUT), \22 \5C\0D\0A    \22RootConstants(b0, num32BitConstants = 2, visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0D\0A\09\22DescriptorTable(SRV(t0), visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0D\0A    \22DescriptorTable(SRV(t1), visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0D\0A\09\22StaticSampler(s0, \22 \5C\0D\0A        \22filter = FILTER_MIN_MAG_MIP_LINEAR, \22 \5C\0D\0A\09\09\22visibility = SHADER_VISIBILITY_PIXEL, \22 \5C\0D\0A\09\09\22addressU = TEXTURE_ADDRESS_BORDER, \22 \5C\0D\0A\09\09\22addressV = TEXTURE_ADDRESS_BORDER, \22 \5C\0D\0A\09\09\22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0D\0A        \22borderColor = STATIC_BORDER_COLOR_OPAQUE_BLACK)\22\0D\0A\0D\0A#define DISPLAY_CURVE_SRGB      0\0D\0A#define ACES_FILMIC             1\0D\0A#define DISPLAY_CURVE_LINEAR    2\0D\0A\0D\0A//ConstantBuffer<VertexShaderConstants> g_vscb : register(b0);\0D\0AConstantBuffer<ToneMapperParams> g_tmp : register(b0);\0D\0ATexture2D g_hdrscene : register(t0);\0D\0ATexture2D g_hdrbloom : register(t1);\0D\0ASamplerState g_sampler : register(s0);\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 position : POSITION;\0D\0A    float2 uv : TEXCOORD;\0D\0A    float3 normal : NORMAL;\0D\0A    float3 tangent : TANGENT;\0D\0A    float3 bitangent : BITANGENT;\0D\0A};\0D\0A\0D\0Astruct PSInput\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float2 uv : TEXCOORD;\0D\0A};\0D\0A\0D\0A[RootSignature(g_RootSignature)]\0D\0APSInput VSMain(VSInput input)\0D\0A{\0D\0A    PSInput result;\0D\0A    result.position = float4(input.position, 1.0f);\0D\0A    result.uv = input.uv;\0D\0A    return result;\0D\0A}\0D\0A\0D\0A[RootSignature(g_RootSignature)]\0D\0Afloat4 PSMain(PSInput input) : SV_TARGET\0D\0A{\0D\0A    float3 scene = g_hdrscene.SampleLevel(g_sampler, input.uv, 0).rgb;\0D\0A    float3 bloom = g_hdrbloom.SampleLevel(g_sampler, input.uv, 0).rgb;\0D\0A    float3 result = lerp(scene, bloom, g_tmp.bloomIntensity);\0D\0A    \0D\0A    if (g_tmp.toneMappingMode == DISPLAY_CURVE_SRGB)\0D\0A    {\0D\0A        result = LinearToSRGB(result);\0D\0A    }\0D\0A    else if (g_tmp.toneMappingMode == ACES_FILMIC)\0D\0A    {\0D\0A        result = ACESFilm(result);\0D\0A    }\0D\0A    else // ToneMappingMode == DISPLAY_CURVE_LINEAR\0D\0A    {\0D\0A        // Just pass through\0D\0A    }\0D\0A    \0D\0A    return float4(result, 1.0f);\0D\0A}"}
