#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; TEXCOORD                 0   xy          1     NONE   float   xy  
; NORMAL                   0   xyz         2     NONE   float       
; TANGENT                  0   xyz         3     NONE   float       
; BITANGENT                0   xyz         4     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
; shader debug name: 28eb846a2787954a0d5458b8eb34c923.pdb
; shader hash: 28eb846a2787954a0d5458b8eb34c923
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              
; NORMAL                   0                              
; TANGENT                  0                              
; BITANGENT                0                              
;
; Output signature:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !46)
!1 = !DIFile(filename: "shaders\5Cpresent.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "VSMain", scope: !1, file: !1, line: 47, type: !18, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @VSMain)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !31}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 40, size: 192, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 42, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !1, line: 43, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 31, size: 448, align: 32, elements: !32)
!32 = !{!33, !42, !43, !44, !45}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !31, file: !1, line: 33, baseType: !34, size: 96, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !36, templateParams: !40)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !35, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!40 = !{!13, !41}
!41 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !31, file: !1, line: 34, baseType: !24, size: 64, align: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !31, file: !1, line: 35, baseType: !34, size: 96, align: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !31, file: !1, line: 36, baseType: !34, size: 96, align: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "bitangent", scope: !31, file: !1, line: 37, baseType: !34, size: 96, align: 32, offset: 352)
!46 = !{!47, !58, !62, !63}
!47 = !DIGlobalVariable(name: "g_tmp", linkageName: "\01?g_tmp@@3U?$ConstantBuffer@UToneMapperParams@@@@A", scope: !0, file: !1, line: 26, type: !48, isLocal: false, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ToneMapperParams>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !49)
!49 = !{!50}
!50 = !DITemplateTypeParameter(name: "T", type: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "ToneMapperParams", file: !52, line: 40, size: 64, align: 32, elements: !53)
!52 = !DIFile(filename: "shaders/../ShaderSharedStructs.h", directory: "")
!53 = !{!54, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "toneMappingMode", scope: !51, file: !52, line: 42, baseType: !55, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !56)
!56 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "bloomIntensity", scope: !51, file: !52, line: 43, baseType: !8, size: 32, align: 32, offset: 32)
!58 = !DIGlobalVariable(name: "g_hdrscene", linkageName: "\01?g_hdrscene@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 27, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 27, size: 160, align: 32, elements: !2, templateParams: !60)
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "element", type: !5)
!62 = !DIGlobalVariable(name: "g_hdrbloom", linkageName: "\01?g_hdrbloom@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 28, type: !59, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 29, type: !64, isLocal: false, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 29, size: 32, align: 32, elements: !2)
!65 = !{i32 2, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!68 = !{!"shaders\5Cpresent.hlsl", !"// present.hlsl\0D\0A// Handles the final tone mapping and display of the scene.\0D\0A// Bloom effect is also blended in here.\0D\0A\0D\0A#include \22../ShaderSharedStructs.h\22\0D\0A#include \22helperFunctions.hlsli\22\0D\0A\0D\0A#define g_RootSignature \5C\0D\0A    \22RootFlags(ALLOW_INPUT_ASSEMBLER_INPUT_LAYOUT), \22 \5C\0D\0A    \22RootConstants(b0, num32BitConstants = 2, visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0D\0A\09\22DescriptorTable(SRV(t0), visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0D\0A    \22DescriptorTable(SRV(t1), visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0D\0A\09\22StaticSampler(s0, \22 \5C\0D\0A        \22filter = FILTER_MIN_MAG_MIP_LINEAR, \22 \5C\0D\0A\09\09\22visibility = SHADER_VISIBILITY_PIXEL, \22 \5C\0D\0A\09\09\22addressU = TEXTURE_ADDRESS_BORDER, \22 \5C\0D\0A\09\09\22addressV = TEXTURE_ADDRESS_BORDER, \22 \5C\0D\0A\09\09\22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0D\0A        \22borderColor = STATIC_BORDER_COLOR_OPAQUE_BLACK)\22\0D\0A\0D\0A#define DISPLAY_CURVE_SRGB      0\0D\0A#define ACES_FILMIC             1\0D\0A#define DISPLAY_CURVE_LINEAR    2\0D\0A\0D\0A//ConstantBuffer<VertexShaderConstants> g_vscb : register(b0);\0D\0AConstantBuffer<ToneMapperParams> g_tmp : register(b0);\0D\0ATexture2D g_hdrscene : register(t0);\0D\0ATexture2D g_hdrbloom : register(t1);\0D\0ASamplerState g_sampler : register(s0);\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 position : POSITION;\0D\0A    float2 uv : TEXCOORD;\0D\0A    float3 normal : NORMAL;\0D\0A    float3 tangent : TANGENT;\0D\0A    float3 bitangent : BITANGENT;\0D\0A};\0D\0A\0D\0Astruct PSInput\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float2 uv : TEXCOORD;\0D\0A};\0D\0A\0D\0A[RootSignature(g_RootSignature)]\0D\0APSInput VSMain(VSInput input)\0D\0A{\0D\0A    PSInput result;\0D\0A    result.position = float4(input.position, 1.0f);\0D\0A    result.uv = input.uv;\0D\0A    return result;\0D\0A}\0D\0A\0D\0A[RootSignature(g_RootSignature)]\0D\0Afloat4 PSMain(PSInput input) : SV_TARGET\0D\0A{\0D\0A    float3 scene = g_hdrscene.SampleLevel(g_sampler, input.uv, 0).rgb;\0D\0A    float3 bloom = g_hdrbloom.SampleLevel(g_sampler, input.uv, 0).rgb;\0D\0A    float3 result = lerp(scene, bloom, g_tmp.bloomIntensity);\0D\0A    \0D\0A    if (g_tmp.toneMappingMode == DISPLAY_CURVE_SRGB)\0D\0A    {\0D\0A        result = LinearToSRGB(result);\0D\0A    }\0D\0A    else if (g_tmp.toneMappingMode == ACES_FILMIC)\0D\0A    {\0D\0A        result = ACESFilm(result);\0D\0A    }\0D\0A    else // ToneMappingMode == DISPLAY_CURVE_LINEAR\0D\0A    {\0D\0A        // Just pass through\0D\0A    }\0D\0A    \0D\0A    return float4(result, 1.0f);\0D\0A}"}
