#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float   xy  
; WORLD_POSITION           0   xyz         2     NONE   float   xyz 
; WORLD_NORMAL             0   xyz         3     NONE   float   xyz 
; WORLD_TANGENT            0   xyz         4     NONE   float   xyz 
; WORLD_BITANGENT          0   xyz         5     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 74bb3f57e2c9f1a1ad4bcb3ac638ee68.pdb
; shader hash: 74bb3f57e2c9f1a1ad4bcb3ac638ee68
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
; WORLD_POSITION           0                 linear       
; WORLD_NORMAL             0                 linear       
; WORLD_TANGENT            0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !62)
!1 = !DIFile(filename: "shaders\5Crender.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !30, !37}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 89, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 89, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 89, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!18, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !32, templateParams: !35)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !{!18, !36}
!36 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !39, templateParams: !44)
!39 = !{!40, !41, !42, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!44 = !{!18, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!46 = !{!47, !58}
!47 = !DISubprogram(name: "PSMain", scope: !1, file: !1, line: 82, type: !48, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @PSMain)
!48 = !DISubroutineType(types: !49)
!49 = !{!37, !50}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 46, size: 576, align: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "clip_position", scope: !50, file: !1, line: 48, baseType: !37, size: 128, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !50, file: !1, line: 49, baseType: !30, size: 64, align: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "world_position", scope: !50, file: !1, line: 50, baseType: !22, size: 96, align: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "world_normal", scope: !50, file: !1, line: 51, baseType: !22, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "world_tangent", scope: !50, file: !1, line: 52, baseType: !22, size: 96, align: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "world_bitangent", scope: !50, file: !1, line: 53, baseType: !22, size: 96, align: 32, offset: 480)
!58 = !DISubprogram(name: "F_Schlick", linkageName: "\01?F_Schlick@@YA?AV?$vector@M$02@@V1@MM@Z", scope: !59, file: !59, line: 126, type: !60, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DIFile(filename: "shaders/helperFunctions.hlsli", directory: "")
!60 = !DISubroutineType(types: !61)
!61 = !{!22, !22, !8, !8}
!62 = !{!63, !94, !101, !108, !112, !113, !117, !119, !123, !124, !125, !127}
!63 = !DIGlobalVariable(name: "g_camera", linkageName: "\01?g_camera@@3U?$ConstantBuffer@UCameraConstants@@@@A", scope: !0, file: !1, line: 24, type: !64, isLocal: false, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraConstants>", file: !1, line: 24, size: 32, align: 32, elements: !2, templateParams: !65)
!65 = !{!66}
!66 = !DITemplateTypeParameter(name: "T", type: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraConstants", file: !68, line: 24, size: 1024, align: 32, elements: !69)
!68 = !DIFile(filename: "shaders/../ShaderSharedStructs.h", directory: "")
!69 = !{!70, !93}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !67, file: !68, line: 26, baseType: !71, size: 512, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 24, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 24, size: 512, align: 32, elements: !73, templateParams: !90)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !72, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!90 = !{!18, !91, !92}
!91 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!92 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !67, file: !68, line: 27, baseType: !71, size: 512, align: 32, offset: 512)
!94 = !DIGlobalVariable(name: "g_model", linkageName: "\01?g_model@@3U?$ConstantBuffer@UModelConstants@@@@A", scope: !0, file: !1, line: 25, type: !95, isLocal: false, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ModelConstants>", file: !1, line: 25, size: 32, align: 32, elements: !2, templateParams: !96)
!96 = !{!97}
!97 = !DITemplateTypeParameter(name: "T", type: !98)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "ModelConstants", file: !68, line: 30, size: 512, align: 32, elements: !99)
!99 = !{!100}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !98, file: !68, line: 32, baseType: !71, size: 512, align: 32)
!101 = !DIGlobalVariable(name: "g_pbrcb", linkageName: "\01?g_pbrcb@@3U?$ConstantBuffer@UPBRConstants@@@@A", scope: !0, file: !1, line: 26, type: !102, isLocal: false, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<PBRConstants>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !103)
!103 = !{!104}
!104 = !DITemplateTypeParameter(name: "T", type: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBRConstants", file: !68, line: 35, size: 96, align: 32, elements: !106)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "eyePosition", scope: !105, file: !68, line: 37, baseType: !22, size: 96, align: 32)
!108 = !DIGlobalVariable(name: "g_irradiance", linkageName: "\01?g_irradiance@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 27, type: !109, isLocal: false, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 27, size: 128, align: 32, elements: !2, templateParams: !110)
!110 = !{!111}
!111 = !DITemplateTypeParameter(name: "element", type: !38)
!112 = !DIGlobalVariable(name: "g_prefilteredEnv", linkageName: "\01?g_prefilteredEnv@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 28, type: !109, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariable(name: "g_BRDF", linkageName: "\01?g_BRDF@@3V?$Texture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 29, type: !114, isLocal: false, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 2> >", file: !1, line: 29, size: 96, align: 32, elements: !2, templateParams: !115)
!115 = !{!116}
!116 = !DITemplateTypeParameter(name: "element", type: !31)
!117 = !DIGlobalVariable(name: "g_diffuse", linkageName: "\01?g_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 30, type: !118, isLocal: false, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 30, size: 160, align: 32, elements: !2, templateParams: !110)
!119 = !DIGlobalVariable(name: "g_normal", linkageName: "\01?g_normal@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 31, type: !120, isLocal: false, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 31, size: 128, align: 32, elements: !2, templateParams: !121)
!121 = !{!122}
!122 = !DITemplateTypeParameter(name: "element", type: !23)
!123 = !DIGlobalVariable(name: "g_arm", linkageName: "\01?g_arm@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 32, type: !120, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariable(name: "g_emission", linkageName: "\01?g_emission@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 33, type: !120, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 34, type: !126, isLocal: false, isDefinition: true)
