#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; TEXCOORD                 0   xy          1     NONE   float   xy  
; NORMAL                   0   xyz         2     NONE   float   xyz 
; TANGENT                  0   xyz         3     NONE   float   xyz 
; BITANGENT                0   xyz         4     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; WORLD_POSITION           0   xyz         2     NONE   float   xyz 
; WORLD_NORMAL             0   xyz         3     NONE   float   xyz 
; WORLD_TANGENT            0   xyz         4     NONE   float   xyz 
; WORLD_BITANGENT          0   xyz         5     NONE   float   xyz 
;
; shader debug name: db7c4d0a7758199796d4b246aa55c944.pdb
; shader hash: db7c4d0a7758199796d4b246aa55c944
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !50)
!1 = !DIFile(filename: "shaders\5Crender.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "VSMain", scope: !1, file: !1, line: 57, type: !18, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @VSMain)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !43}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 46, size: 576, align: 32, elements: !21)
!21 = !{!22, !23, !31, !40, !41, !42}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "clip_position", scope: !20, file: !1, line: 48, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !1, line: 49, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "world_position", scope: !20, file: !1, line: 50, baseType: !32, size: 96, align: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !34, templateParams: !38)
!34 = !{!35, !36, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !33, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !33, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !33, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!38 = !{!13, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "world_normal", scope: !20, file: !1, line: 51, baseType: !32, size: 96, align: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "world_tangent", scope: !20, file: !1, line: 52, baseType: !32, size: 96, align: 32, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "world_bitangent", scope: !20, file: !1, line: 53, baseType: !32, size: 96, align: 32, offset: 480)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 37, size: 448, align: 32, elements: !44)
!44 = !{!45, !46, !47, !48, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "obj_position", scope: !43, file: !1, line: 39, baseType: !32, size: 96, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !43, file: !1, line: 40, baseType: !24, size: 64, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "obj_normal", scope: !43, file: !1, line: 41, baseType: !32, size: 96, align: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "obj_tangent", scope: !43, file: !1, line: 42, baseType: !32, size: 96, align: 32, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "obj_bitangent", scope: !43, file: !1, line: 43, baseType: !32, size: 96, align: 32, offset: 352)
!50 = !{!51, !82, !89, !96, !100, !101, !105, !107, !111, !112, !113, !115}
!51 = !DIGlobalVariable(name: "g_camera", linkageName: "\01?g_camera@@3U?$ConstantBuffer@UCameraConstants@@@@A", scope: !0, file: !1, line: 24, type: !52, isLocal: false, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraConstants>", file: !1, line: 24, size: 32, align: 32, elements: !2, templateParams: !53)
!53 = !{!54}
!54 = !DITemplateTypeParameter(name: "T", type: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraConstants", file: !56, line: 24, size: 1024, align: 32, elements: !57)
!56 = !DIFile(filename: "shaders/../ShaderSharedStructs.h", directory: "")
!57 = !{!58, !81}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !55, file: !56, line: 26, baseType: !59, size: 512, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 24, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 24, size: 512, align: 32, elements: !61, templateParams: !78)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !60, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!78 = !{!13, !79, !80}
!79 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!80 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !55, file: !56, line: 27, baseType: !59, size: 512, align: 32, offset: 512)
!82 = !DIGlobalVariable(name: "g_model", linkageName: "\01?g_model@@3U?$ConstantBuffer@UModelConstants@@@@A", scope: !0, file: !1, line: 25, type: !83, isLocal: false, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ModelConstants>", file: !1, line: 25, size: 32, align: 32, elements: !2, templateParams: !84)
!84 = !{!85}
!85 = !DITemplateTypeParameter(name: "T", type: !86)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "ModelConstants", file: !56, line: 30, size: 512, align: 32, elements: !87)
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !86, file: !56, line: 32, baseType: !59, size: 512, align: 32)
!89 = !DIGlobalVariable(name: "g_pbrcb", linkageName: "\01?g_pbrcb@@3U?$ConstantBuffer@UPBRConstants@@@@A", scope: !0, file: !1, line: 26, type: !90, isLocal: false, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<PBRConstants>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !91)
!91 = !{!92}
!92 = !DITemplateTypeParameter(name: "T", type: !93)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBRConstants", file: !56, line: 35, size: 96, align: 32, elements: !94)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "eyePosition", scope: !93, file: !56, line: 37, baseType: !32, size: 96, align: 32)
!96 = !DIGlobalVariable(name: "g_irradiance", linkageName: "\01?g_irradiance@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 27, type: !97, isLocal: false, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 27, size: 128, align: 32, elements: !2, templateParams: !98)
!98 = !{!99}
!99 = !DITemplateTypeParameter(name: "element", type: !5)
!100 = !DIGlobalVariable(name: "g_prefilteredEnv", linkageName: "\01?g_prefilteredEnv@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 28, type: !97, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "g_BRDF", linkageName: "\01?g_BRDF@@3V?$Texture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 29, type: !102, isLocal: false, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 2> >", file: !1, line: 29, size: 96, align: 32, elements: !2, templateParams: !103)
!103 = !{!104}
!104 = !DITemplateTypeParameter(name: "element", type: !25)
!105 = !DIGlobalVariable(name: "g_diffuse", linkageName: "\01?g_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 30, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 30, size: 160, align: 32, elements: !2, templateParams: !98)
!107 = !DIGlobalVariable(name: "g_normal", linkageName: "\01?g_normal@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 31, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 31, size: 128, align: 32, elements: !2, templateParams: !109)
!109 = !{!110}
!110 = !DITemplateTypeParameter(name: "element", type: !33)
!111 = !DIGlobalVariable(name: "g_arm", linkageName: "\01?g_arm@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 32, type: !108, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "g_emission", linkageName: "\01?g_emission@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 33, type: !108, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 34, type: !114, isLocal: false, isDefinition: true)
