#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; OBJECT_POSITION          0   xyz         1     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 1bc0c38bae2b7d7418c24770710b082f.pdb
; shader hash: 1bc0c38bae2b7d7418c24770710b082f
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; OBJECT_POSITION          0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !14, globals: !43)
!1 = !DIFile(filename: "shaders\5Cspherical2Cube.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 48, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 48, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !{!15, !39}
!15 = !DISubprogram(name: "PSMain", scope: !1, file: !1, line: 46, type: !16, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @PSMain)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !27}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !20, templateParams: !25)
!20 = !{!21, !22, !23, !24}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !19, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !19, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !19, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !19, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!25 = !{!11, !26}
!26 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 27, size: 224, align: 32, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "clip_position", scope: !27, file: !1, line: 29, baseType: !18, size: 128, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "obj_position", scope: !27, file: !1, line: 30, baseType: !31, size: 96, align: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!11, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!39 = !DISubprogram(name: "SampleSphericalMap", linkageName: "\01?SampleSphericalMap@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !40, file: !40, line: 41, type: !41, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false)
!40 = !DIFile(filename: "shaders/helperFunctions.hlsli", directory: "")
!41 = !DISubroutineType(types: !42)
!42 = !{!4, !31}
!43 = !{!44, !75, !79}
!44 = !DIGlobalVariable(name: "g_camera", linkageName: "\01?g_camera@@3U?$ConstantBuffer@UCameraConstants@@@@A", scope: !0, file: !1, line: 14, type: !45, isLocal: false, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraConstants>", file: !1, line: 14, size: 32, align: 32, elements: !2, templateParams: !46)
!46 = !{!47}
!47 = !DITemplateTypeParameter(name: "T", type: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraConstants", file: !49, line: 24, size: 1024, align: 32, elements: !50)
!49 = !DIFile(filename: "shaders/../ShaderSharedStructs.h", directory: "")
!50 = !{!51, !74}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !48, file: !49, line: 26, baseType: !52, size: 512, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 14, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 14, size: 512, align: 32, elements: !54, templateParams: !71)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !53, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!71 = !{!11, !72, !73}
!72 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!73 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !48, file: !49, line: 27, baseType: !52, size: 512, align: 32, offset: 512)
!75 = !DIGlobalVariable(name: "g_tex_spherical", linkageName: "\01?g_tex_spherical@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 15, type: !76, isLocal: false, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 15, size: 160, align: 32, elements: !2, templateParams: !77)
!77 = !{!78}
!78 = !DITemplateTypeParameter(name: "element", type: !19)
!79 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 16, type: !80, isLocal: false, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 16, size: 32, align: 32, elements: !2)
!81 = !{i32 2, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!84 = !{!"shaders\5Cspherical2Cube.hlsl", !"#include \22../ShaderSharedStructs.h\22\0D\0A#include \22helperFunctions.hlsli\22\0D\0A\0D\0A#define g_RootSignature \5C\0D\0A    \22RootFlags(ALLOW_INPUT_ASSEMBLER_INPUT_LAYOUT), \22 \5C\0D\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0D\0A\09\22DescriptorTable(SRV(t0), visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0D\0A\09\22StaticSampler(s0, \22 \5C\0D\0A        \22filter = FILTER_MIN_MAG_LINEAR_MIP_POINT, \22 \5C\0D\0A\09\09\22visibility = SHADER_VISIBILITY_PIXEL, \22 \5C\0D\0A\09\09\22addressU = TEXTURE_ADDRESS_BORDER, \22 \5C\0D\0A\09\09\22addressV = TEXTURE_ADDRESS_BORDER)\22\0D\0A\0D\0AConstantBuffer<CameraConstants> g_camera : register(b0);\0D\0ATexture2D g_tex_spherical : register(t0);\0D\0ASamplerState g_sampler : register(s0);\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 obj_position : POSITION;\0D\0A    float2 uv : TEXCOORD;\0D\0A    float3 obj_normal : NORMAL;\0D\0A    float3 obj_tangent : TANGENT;\0D\0A    float3 obj_bitangent : BITANGENT;\0D\0A};\0D\0A\0D\0Astruct PSInput\0D\0A{\0D\0A    float4 clip_position : SV_POSITION;\0D\0A    float3 obj_position : OBJECT_POSITION;\0D\0A};\0D\0A\0D\0A[RootSignature(g_RootSignature)]\0D\0APSInput VSMain(VSInput input)\0D\0A{\0D\0A    PSInput result;\0D\0A    float4 pos = float4(input.obj_position, 1.0f);\0D\0A    pos = mul(g_camera.view, pos);\0D\0A    pos = mul(g_camera.projection, pos);\0D\0A    result.clip_position = pos;\0D\0A    result.obj_position = input.obj_position;\0D\0A    return result;\0D\0A}\0D\0A\0D\0A[RootSignature(g_RootSignature)]\0D\0Afloat4 PSMain(PSInput input) : SV_TARGET\0D\0A{\0D\0A    float2 uv = SampleSphericalMap(normalize(input.obj_position));\0D\0A    return g_tex_spherical.SampleLevel(g_sampler, uv, 0);\0D\0A}\0D\0A"}
