#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; TEXCOORD                 0   xy          1     NONE   float       
; NORMAL                   0   xyz         2     NONE   float       
; TANGENT                  0   xyz         3     NONE   float       
; BITANGENT                0   xyz         4     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; OBJECT_POSITION          0   xyz         1     NONE   float   xyz 
;
; shader debug name: 6e74f6443c8176930cddf06f4acb6154.pdb
; shader hash: 6e74f6443c8176930cddf06f4acb6154
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              
; NORMAL                   0                              
; TANGENT                  0                              
; BITANGENT                0                              
;
; Output signature:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !46)
!1 = !DIFile(filename: "shaders\5Cspherical2Cube.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "VSMain", scope: !1, file: !1, line: 34, type: !18, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @VSMain)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 27, size: 224, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "clip_position", scope: !20, file: !1, line: 29, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "obj_position", scope: !20, file: !1, line: 30, baseType: !24, size: 96, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 18, size: 448, align: 32, elements: !33)
!33 = !{!34, !35, !43, !44, !45}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "obj_position", scope: !32, file: !1, line: 20, baseType: !24, size: 96, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !32, file: !1, line: 21, baseType: !36, size: 64, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !38, templateParams: !41)
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !{!13, !42}
!42 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "obj_normal", scope: !32, file: !1, line: 22, baseType: !24, size: 96, align: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "obj_tangent", scope: !32, file: !1, line: 23, baseType: !24, size: 96, align: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "obj_bitangent", scope: !32, file: !1, line: 24, baseType: !24, size: 96, align: 32, offset: 352)
!46 = !{!47, !78, !82}
!47 = !DIGlobalVariable(name: "g_camera", linkageName: "\01?g_camera@@3U?$ConstantBuffer@UCameraConstants@@@@A", scope: !0, file: !1, line: 14, type: !48, isLocal: false, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraConstants>", file: !1, line: 14, size: 32, align: 32, elements: !2, templateParams: !49)
!49 = !{!50}
!50 = !DITemplateTypeParameter(name: "T", type: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraConstants", file: !52, line: 24, size: 1024, align: 32, elements: !53)
!52 = !DIFile(filename: "shaders/../ShaderSharedStructs.h", directory: "")
!53 = !{!54, !77}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !51, file: !52, line: 26, baseType: !55, size: 512, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 14, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 14, size: 512, align: 32, elements: !57, templateParams: !74)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !56, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!74 = !{!13, !75, !76}
!75 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!76 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !51, file: !52, line: 27, baseType: !55, size: 512, align: 32, offset: 512)
!78 = !DIGlobalVariable(name: "g_tex_spherical", linkageName: "\01?g_tex_spherical@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 15, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 15, size: 160, align: 32, elements: !2, templateParams: !80)
!80 = !{!81}
!81 = !DITemplateTypeParameter(name: "element", type: !5)
!82 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 16, type: !83, isLocal: false, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 16, size: 32, align: 32, elements: !2)
!84 = !{i32 2, !"Dwarf Version", i32 4}
!85 = !{i32 2, !"Debug Info Version", i32 3}
!86 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!87 = !{!"shaders\5Cspherical2Cube.hlsl", !"#include \22../ShaderSharedStructs.h\22\0D\0A#include \22helperFunctions.hlsli\22\0D\0A\0D\0A#define g_RootSignature \5C\0D\0A    \22RootFlags(ALLOW_INPUT_ASSEMBLER_INPUT_LAYOUT), \22 \5C\0D\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0D\0A\09\22DescriptorTable(SRV(t0), visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0D\0A\09\22StaticSampler(s0, \22 \5C\0D\0A        \22filter = FILTER_MIN_MAG_LINEAR_MIP_POINT, \22 \5C\0D\0A\09\09\22visibility = SHADER_VISIBILITY_PIXEL, \22 \5C\0D\0A\09\09\22addressU = TEXTURE_ADDRESS_BORDER, \22 \5C\0D\0A\09\09\22addressV = TEXTURE_ADDRESS_BORDER)\22\0D\0A\0D\0AConstantBuffer<CameraConstants> g_camera : register(b0);\0D\0ATexture2D g_tex_spherical : register(t0);\0D\0ASamplerState g_sampler : register(s0);\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 obj_position : POSITION;\0D\0A    float2 uv : TEXCOORD;\0D\0A    float3 obj_normal : NORMAL;\0D\0A    float3 obj_tangent : TANGENT;\0D\0A    float3 obj_bitangent : BITANGENT;\0D\0A};\0D\0A\0D\0Astruct PSInput\0D\0A{\0D\0A    float4 clip_position : SV_POSITION;\0D\0A    float3 obj_position : OBJECT_POSITION;\0D\0A};\0D\0A\0D\0A[RootSignature(g_RootSignature)]\0D\0APSInput VSMain(VSInput input)\0D\0A{\0D\0A    PSInput result;\0D\0A    float4 pos = float4(input.obj_position, 1.0f);\0D\0A    pos = mul(g_camera.view, pos);\0D\0A    pos = mul(g_camera.projection, pos);\0D\0A    result.clip_position = pos;\0D\0A    result.obj_position = input.obj_position;\0D\0A    return result;\0D\0A}\0D\0A\0D\0A[RootSignature(g_RootSignature)]\0D\0Afloat4 PSMain(PSInput input) : SV_TARGET\0D\0A{\0D\0A    float2 uv = SampleSphericalMap(normalize(input.obj_position));\0D\0A    return g_tex_spherical.SampleLevel(g_sampler, uv, 0);\0D\0A}\0D\0A"}
