#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 3ceb35f219f1d50c1bda395a2464f82e.pdb
; shader hash: 3ceb35f219f1d50c1bda395a2464f82e
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer g_params
; {
;
;   struct g_params
;   {
;
;       struct struct.BlendParams
;       {
;
;           float2 uvScale;                           ; Offset:    0
;           uint targetWidth;                         ; Offset:    8
;           uint targetHeight;                        ; Offset:   12
;           uint mipLevel;                            ; Offset:   16
;           float blendFactor;                        ; Offset:   20
;       
;       } g_params;                                   ; Offset:    0
;
;   
;   } g_params;                                       ; Offset:    0 Size:    24
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_params                          cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !23, globals: !33)
!1 = !DIFile(filename: "shaders\5CupsampleBlend.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 45, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 45, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 45, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 45, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 48, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 48, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 48, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 48, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 48, baseType: !13, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!21, !22}
!21 = !DITemplateTypeParameter(name: "element", type: !13)
!22 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!23 = !{!24}
!24 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 25, type: !25, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, size: 64, align: 32, elements: !29, templateParams: !32)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !{!21, !12}
!33 = !{!34, !48, !60, !61, !63}
!34 = !DIGlobalVariable(name: "g_params", linkageName: "\01?g_params@@3U?$ConstantBuffer@UBlendParams@@@@A", scope: !0, file: !1, line: 17, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<BlendParams>", file: !1, line: 17, size: 32, align: 32, elements: !2, templateParams: !36)
!36 = !{!37}
!37 = !DITemplateTypeParameter(name: "T", type: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "BlendParams", file: !39, line: 90, size: 192, align: 32, elements: !40)
!39 = !DIFile(filename: "shaders/../ShaderSharedStructs.h", directory: "")
!40 = !{!41, !42, !45, !46, !47}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "uvScale", scope: !38, file: !39, line: 92, baseType: !4, size: 64, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "targetWidth", scope: !38, file: !39, line: 93, baseType: !43, size: 32, align: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 17, baseType: !44)
!44 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "targetHeight", scope: !38, file: !39, line: 94, baseType: !43, size: 32, align: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mipLevel", scope: !38, file: !39, line: 95, baseType: !43, size: 32, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "blendFactor", scope: !38, file: !39, line: 96, baseType: !8, size: 32, align: 32, offset: 160)
!48 = !DIGlobalVariable(name: "g_blendSrcHires", linkageName: "\01?g_blendSrcHires@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 18, type: !49, isLocal: false, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 18, size: 160, align: 32, elements: !2, templateParams: !50)
!50 = !{!51}
!51 = !DITemplateTypeParameter(name: "element", type: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 18, size: 128, align: 32, elements: !53, templateParams: !58)
!53 = !{!54, !55, !56, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!58 = !{!11, !59}
!59 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!60 = !DIGlobalVariable(name: "g_blendSrcLowres", linkageName: "\01?g_blendSrcLowres@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 19, type: !49, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariable(name: "g_blendTarget", linkageName: "\01?g_blendTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 20, type: !62, isLocal: false, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 20, size: 128, align: 32, elements: !2, templateParams: !50)
!63 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 21, type: !64, isLocal: false, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 21, size: 32, align: 32, elements: !2)
!65 = !{i32 2, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!68 = !{!"shaders\5CupsampleBlend.hlsl", !"#include \22../ShaderSharedStructs.h\22\0D\0A#include \22helperFunctions.hlsli\22\0D\0A\0D\0A#define g_RootSignature \5C\0D\0A    \22RootFlags(0), \22 \5C\0D\0A    \22RootConstants(b0, num32BitConstants = 6), \22 \5C\0D\0A    \22DescriptorTable( SRV(t0, numDescriptors = 1) ),\22 \5C\0D\0A    \22DescriptorTable( SRV(t1, numDescriptors = 1) ),\22 \5C\0D\0A    \22DescriptorTable( UAV(u0, numDescriptors = 1) ),\22 \5C\0D\0A    \22StaticSampler(s0,\22 \5C\0D\0A        \22filter = FILTER_MIN_MAG_MIP_LINEAR,\22 \5C\0D\0A        \22addressU = TEXTURE_ADDRESS_BORDER,\22 \5C\0D\0A        \22addressV = TEXTURE_ADDRESS_BORDER,\22 \5C\0D\0A        \22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0D\0A        \22borderColor = STATIC_BORDER_COLOR_OPAQUE_BLACK)\22\0D\0A\0D\0AConstantBuffer<BlendParams> g_params : register(b0);\0D\0ATexture2D<float4> g_blendSrcHires : register(t0);\0D\0ATexture2D<float4> g_blendSrcLowres : register(t1);\0D\0ARWTexture2D<float4> g_blendTarget : register(u0);\0D\0ASamplerState g_sampler : register(s0);\0D\0A\0D\0A[RootSignature(g_RootSignature)]\0D\0A[numthreads(8, 8, 1)]\0D\0Avoid CSMain(int2 dt : SV_DispatchThreadID)\0D\0A{\0D\0A    // Out-of-bounds check.\0D\0A    if (dt.x >= g_params.targetWidth || dt.y >= g_params.targetHeight)\0D\0A    {\0D\0A        return;\0D\0A    }\0D\0A    \0D\0A    //\0D\0A    // Convert dt to uv coords.\0D\0A    //\0D\0A    // We want:\0D\0A    //      uv = ( (dt + 0.5) / targetDimension) * (1.0f / 2^(targetMipLevel + 1))\0D\0A    //                       ^                                  ^\0D\0A    //                  range (0, 1)                   the top-left fraction\0D\0A    //                                              containing the low res input\0D\0A    //\0D\0A    // Compute from CPU side:\0D\0A    //      uvScale = 1.0f / ( targetDimension << (targetMipLevel + 1) )\0D\0A    //\0D\0A    float2 uv = ((float2) dt + 0.5f) * g_params.uvScale;\0D\0A    \0D\0A    // Blend\0D\0A    g_blendTarget[dt] = lerp(g_blendSrcHires.Load(int3(dt, g_params.mipLevel)), g_blendSrcLowres.SampleLevel(g_sampler, uv, 0), g_params.blendFactor);\0D\0A}\0D\0A"}
